zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXE317MPA-pinctrl.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef HAL_NXP_DTS_NXP_MCXE317MPA_PINCTRL_H_
#define HAL_NXP_DTS_NXP_MCXE317MPA_PINCTRL_H_

#include <zephyr/dt-bindings/pinctrl/nxp-s32-pinctrl.h>

/* SIUL */
#define PTA0_EIRQ0                      NXP_S32_PINMUX(0, 0, 0, 0, 16, 1)
#define PTA1_EIRQ1                      NXP_S32_PINMUX(0, 0, 1, 0, 17, 1)
#define PTA2_EIRQ2                      NXP_S32_PINMUX(0, 0, 2, 0, 18, 1)
#define PTA3_EIRQ3                      NXP_S32_PINMUX(0, 0, 3, 0, 19, 1)
#define PTA4_EIRQ4                      NXP_S32_PINMUX(0, 0, 4, 0, 20, 1)
#define PTA5_EIRQ5                      NXP_S32_PINMUX(0, 0, 5, 0, 21, 1)
#define PTA6_EIRQ6                      NXP_S32_PINMUX(0, 0, 6, 0, 22, 1)
#define PTA7_EIRQ7                      NXP_S32_PINMUX(0, 0, 7, 0, 23, 1)
#define PTA8_EIRQ16                     NXP_S32_PINMUX(0, 0, 8, 0, 32, 1)
#define PTA9_EIRQ17                     NXP_S32_PINMUX(0, 0, 9, 0, 33, 1)
#define PTA10_EIRQ18                    NXP_S32_PINMUX(0, 0, 10, 0, 34, 1)
#define PTA11_EIRQ19                    NXP_S32_PINMUX(0, 0, 11, 0, 35, 1)
#define PTA12_EIRQ20                    NXP_S32_PINMUX(0, 0, 12, 0, 36, 1)
#define PTA13_EIRQ21                    NXP_S32_PINMUX(0, 0, 13, 0, 37, 1)
#define PTA14_EIRQ22                    NXP_S32_PINMUX(0, 0, 14, 0, 38, 1)
#define PTA15_EIRQ23                    NXP_S32_PINMUX(0, 0, 15, 0, 39, 1)
#define PTA16_EIRQ4                     NXP_S32_PINMUX(0, 0, 16, 0, 20, 2)
#define PTA18_EIRQ0                     NXP_S32_PINMUX(0, 0, 18, 0, 16, 2)
#define PTA19_EIRQ1                     NXP_S32_PINMUX(0, 0, 19, 0, 17, 2)
#define PTA20_EIRQ2                     NXP_S32_PINMUX(0, 0, 20, 0, 18, 2)
#define PTA21_EIRQ3                     NXP_S32_PINMUX(0, 0, 21, 0, 19, 2)
#define PTA24_GPI24                     NXP_S32_PINMUX(0, 0, 21, 0, 24, 0)
#define PTA25_GPI25                     NXP_S32_PINMUX(0, 0, 21, 0, 25, 0)
#define PTA25_EIRQ5                     NXP_S32_PINMUX(0, 0, 21, 0, 21, 2)
#define PTA28_EIRQ6                     NXP_S32_PINMUX(0, 0, 28, 0, 22, 2)
#define PTA30_EIRQ7                     NXP_S32_PINMUX(0, 0, 30, 0, 23, 2)
#define PTB0_EIRQ8                      NXP_S32_PINMUX(0, 0, 32, 0, 24, 1)
#define PTB1_EIRQ9                      NXP_S32_PINMUX(0, 0, 33, 0, 25, 1)
#define PTB2_EIRQ10                     NXP_S32_PINMUX(0, 0, 34, 0, 26, 1)
#define PTB3_EIRQ11                     NXP_S32_PINMUX(0, 0, 35, 0, 27, 1)
#define PTB4_EIRQ12                     NXP_S32_PINMUX(0, 0, 36, 0, 28, 1)
#define PTB5_EIRQ13                     NXP_S32_PINMUX(0, 0, 37, 0, 29, 1)
#define PTB8_EIRQ14                     NXP_S32_PINMUX(0, 0, 40, 0, 30, 1)
#define PTB9_EIRQ15                     NXP_S32_PINMUX(0, 0, 41, 0, 31, 1)
#define PTB10_EIRQ24                    NXP_S32_PINMUX(0, 0, 42, 0, 40, 1)
#define PTB11_EIRQ25                    NXP_S32_PINMUX(0, 0, 43, 0, 41, 1)
#define PTB12_EIRQ26                    NXP_S32_PINMUX(0, 0, 44, 0, 42, 1)
#define PTB13_EIRQ27                    NXP_S32_PINMUX(0, 0, 45, 0, 43, 1)
#define PTB14_EIRQ28                    NXP_S32_PINMUX(0, 0, 46, 0, 44, 1)
#define PTB15_EIRQ29                    NXP_S32_PINMUX(0, 0, 47, 0, 45, 1)
#define PTB16_EIRQ30                    NXP_S32_PINMUX(0, 0, 48, 0, 46, 1)
#define PTB17_EIRQ31                    NXP_S32_PINMUX(0, 0, 49, 0, 47, 1)
#define PTB21_EIRQ8                     NXP_S32_PINMUX(0, 0, 53, 0, 24, 2)
#define PTB22_EIRQ9                     NXP_S32_PINMUX(0, 0, 54, 0, 25, 2)
#define PTB23_EIRQ10                    NXP_S32_PINMUX(0, 0, 55, 0, 26, 2)
#define PTB24_EIRQ11                    NXP_S32_PINMUX(0, 0, 56, 0, 27, 2)
#define PTB25_EIRQ12                    NXP_S32_PINMUX(0, 0, 57, 0, 28, 2)
#define PTB26_EIRQ13                    NXP_S32_PINMUX(0, 0, 58, 0, 29, 2)
#define PTB28_EIRQ14                    NXP_S32_PINMUX(0, 0, 60, 0, 30, 2)
#define PTC0_EIRQ0                      NXP_S32_PINMUX(0, 0, 64, 0, 16, 3)
#define PTC1_EIRQ1                      NXP_S32_PINMUX(0, 0, 65, 0, 17, 3)
#define PTC2_EIRQ2                      NXP_S32_PINMUX(0, 0, 66, 0, 18, 3)
#define PTC3_EIRQ3                      NXP_S32_PINMUX(0, 0, 67, 0, 19, 3)
#define PTC4_EIRQ4                      NXP_S32_PINMUX(0, 0, 68, 0, 20, 3)
#define PTC5_EIRQ5                      NXP_S32_PINMUX(0, 0, 69, 0, 21, 3)
#define PTC6_EIRQ6                      NXP_S32_PINMUX(0, 0, 70, 0, 22, 3)
#define PTC7_EIRQ7                      NXP_S32_PINMUX(0, 0, 71, 0, 23, 3)
#define PTC8_EIRQ16                     NXP_S32_PINMUX(0, 0, 72, 0, 32, 2)
#define PTC9_EIRQ17                     NXP_S32_PINMUX(0, 0, 73, 0, 33, 2)
#define PTC10_EIRQ18                    NXP_S32_PINMUX(0, 0, 74, 0, 34, 2)
#define PTC11_EIRQ19                    NXP_S32_PINMUX(0, 0, 75, 0, 35, 2)
#define PTC12_EIRQ20                    NXP_S32_PINMUX(0, 0, 76, 0, 36, 2)
#define PTC13_EIRQ21                    NXP_S32_PINMUX(0, 0, 77, 0, 37, 2)
#define PTC14_EIRQ22                    NXP_S32_PINMUX(0, 0, 78, 0, 38, 2)
#define PTC15_EIRQ23                    NXP_S32_PINMUX(0, 0, 79, 0, 39, 2)
#define PTC20_EIRQ16                    NXP_S32_PINMUX(0, 0, 84, 0, 32, 3)
#define PTC21_EIRQ17                    NXP_S32_PINMUX(0, 0, 85, 0, 33, 3)
#define PTC23_EIRQ18                    NXP_S32_PINMUX(0, 0, 87, 0, 34, 3)
#define PTC24_EIRQ19                    NXP_S32_PINMUX(0, 0, 88, 0, 35, 3)
#define PTC25_EIRQ20                    NXP_S32_PINMUX(0, 0, 89, 0, 36, 3)
#define PTC26_EIRQ21                    NXP_S32_PINMUX(0, 0, 90, 0, 37, 3)
#define PTC27_EIRQ22                    NXP_S32_PINMUX(0, 0, 91, 0, 38, 3)
#define PTC29_EIRQ23                    NXP_S32_PINMUX(0, 0, 93, 0, 39, 3)
#define PTD0_EIRQ8                      NXP_S32_PINMUX(0, 0, 96, 0, 24, 3)
#define PTD1_EIRQ9                      NXP_S32_PINMUX(0, 0, 97, 0, 25, 3)
#define PTD2_EIRQ10                     NXP_S32_PINMUX(0, 0, 98, 0, 26, 3)
#define PTD3_EIRQ11                     NXP_S32_PINMUX(0, 0, 99, 0, 27, 3)
#define PTD4_EIRQ12                     NXP_S32_PINMUX(0, 0, 100, 0, 28, 3)
#define PTD5_EIRQ13                     NXP_S32_PINMUX(0, 0, 101, 0, 29, 3)
#define PTD6_EIRQ14                     NXP_S32_PINMUX(0, 0, 102, 0, 30, 3)
#define PTD7_EIRQ15                     NXP_S32_PINMUX(0, 0, 103, 0, 31, 3)
#define PTD8_EIRQ24                     NXP_S32_PINMUX(0, 0, 104, 0, 40, 2)
#define PTD9_EIRQ25                     NXP_S32_PINMUX(0, 0, 105, 0, 41, 2)
#define PTD10_EIRQ26                    NXP_S32_PINMUX(0, 0, 106, 0, 42, 2)
#define PTD11_EIRQ27                    NXP_S32_PINMUX(0, 0, 107, 0, 43, 2)
#define PTD12_EIRQ28                    NXP_S32_PINMUX(0, 0, 108, 0, 44, 2)
#define PTD13_EIRQ29                    NXP_S32_PINMUX(0, 0, 109, 0, 45, 2)
#define PTD14_EIRQ30                    NXP_S32_PINMUX(0, 0, 110, 0, 46, 3)
#define PTD15_EIRQ31                    NXP_S32_PINMUX(0, 0, 111, 0, 47, 2)
#define PTD17_EIRQ24                    NXP_S32_PINMUX(0, 0, 113, 0, 40, 3)
#define PTD20_EIRQ25                    NXP_S32_PINMUX(0, 0, 116, 0, 41, 3)
#define PTD21_EIRQ26                    NXP_S32_PINMUX(0, 0, 117, 0, 42, 3)
#define PTD22_EIRQ27                    NXP_S32_PINMUX(0, 0, 118, 0, 43, 3)
#define PTD23_EIRQ28                    NXP_S32_PINMUX(0, 0, 119, 0, 44, 3)
#define PTD24_EIRQ29                    NXP_S32_PINMUX(0, 0, 120, 0, 45, 3)
#define PTD27_EIRQ30                    NXP_S32_PINMUX(0, 0, 123, 0, 46, 2)
#define PTD28_EIRQ31                    NXP_S32_PINMUX(0, 0, 124, 0, 47, 3)
#define PTE0_EIRQ0                      NXP_S32_PINMUX(0, 0, 128, 0, 16, 4)
#define PTE1_EIRQ1                      NXP_S32_PINMUX(0, 0, 129, 0, 17, 4)
#define PTE2_EIRQ2                      NXP_S32_PINMUX(0, 0, 130, 0, 18, 4)
#define PTE3_EIRQ3                      NXP_S32_PINMUX(0, 0, 131, 0, 19, 4)
#define PTE4_EIRQ4                      NXP_S32_PINMUX(0, 0, 132, 0, 20, 4)
#define PTE5_EIRQ5                      NXP_S32_PINMUX(0, 0, 133, 0, 21, 4)
#define PTE6_EIRQ6                      NXP_S32_PINMUX(0, 0, 134, 0, 22, 4)
#define PTE8_EIRQ7                      NXP_S32_PINMUX(0, 0, 136, 0, 23, 4)
#define PTE9_EIRQ8                      NXP_S32_PINMUX(0, 0, 137, 0, 24, 4)
#define PTE10_EIRQ9                     NXP_S32_PINMUX(0, 0, 138, 0, 25, 4)
#define PTE11_EIRQ10                    NXP_S32_PINMUX(0, 0, 139, 0, 26, 4)
#define PTE12_EIRQ11                    NXP_S32_PINMUX(0, 0, 140, 0, 27, 4)
#define PTE13_EIRQ12                    NXP_S32_PINMUX(0, 0, 141, 0, 28, 4)
#define PTE14_EIRQ13                    NXP_S32_PINMUX(0, 0, 142, 0, 29, 4)
#define PTE15_EIRQ14                    NXP_S32_PINMUX(0, 0, 143, 0, 30, 4)
#define PTE16_EIRQ15                    NXP_S32_PINMUX(0, 0, 144, 0, 31, 4)

/* EMIOS_0 */
#define PTA0_EMIOS_0_CH17_Y_O           NXP_S32_PINMUX(0, 0, 0, 2, 0, 0)
#define PTA0_EMIOS_0_CH17_Y_I           NXP_S32_PINMUX(0, 0, 0, 0, 65, 2)
#define PTA1_EMIOS_0_CH9_H_O            NXP_S32_PINMUX(0, 0, 1, 2, 0, 0)
#define PTA1_EMIOS_0_CH9_H_I            NXP_S32_PINMUX(0, 0, 1, 0, 57, 1)
#define PTA10_EMIOS_0_CH12_H_O          NXP_S32_PINMUX(0, 0, 10, 2, 0, 0)
#define PTA10_EMIOS_0_CH12_H_I          NXP_S32_PINMUX(0, 0, 10, 0, 60, 2)
#define PTA11_EMIOS_0_CH13_H_O          NXP_S32_PINMUX(0, 0, 11, 2, 0, 0)
#define PTA11_EMIOS_0_CH13_H_I          NXP_S32_PINMUX(0, 0, 11, 0, 61, 1)
#define PTA12_EMIOS_0_CH14_H_O          NXP_S32_PINMUX(0, 0, 12, 2, 0, 0)
#define PTA12_EMIOS_0_CH14_H_I          NXP_S32_PINMUX(0, 0, 12, 0, 62, 1)
#define PTA13_EMIOS_0_CH15_H_O          NXP_S32_PINMUX(0, 0, 13, 2, 0, 0)
#define PTA13_EMIOS_0_CH15_H_I          NXP_S32_PINMUX(0, 0, 13, 0, 63, 2)
#define PTA15_EMIOS_0_CH10_H_O          NXP_S32_PINMUX(0, 0, 15, 2, 0, 0)
#define PTA15_EMIOS_0_CH10_H_I          NXP_S32_PINMUX(0, 0, 15, 0, 58, 2)
#define PTA16_EMIOS_0_CH11_H_O          NXP_S32_PINMUX(0, 0, 16, 2, 0, 0)
#define PTA16_EMIOS_0_CH11_H_I          NXP_S32_PINMUX(0, 0, 16, 0, 59, 2)
#define PTA17_EMIOS_0_CH6_G_O           NXP_S32_PINMUX(0, 0, 17, 2, 0, 0)
#define PTA17_EMIOS_0_CH6_G_I           NXP_S32_PINMUX(0, 0, 17, 0, 54, 2)
#define PTB0_EMIOS_0_CH3_G_O            NXP_S32_PINMUX(0, 0, 32, 4, 0, 0)
#define PTB0_EMIOS_0_CH3_G_I            NXP_S32_PINMUX(0, 0, 32, 0, 51, 4)
#define PTB1_EMIOS_0_CH7_G_O            NXP_S32_PINMUX(0, 0, 33, 4, 0, 0)
#define PTB1_EMIOS_0_CH7_G_I            NXP_S32_PINMUX(0, 0, 33, 0, 55, 3)
#define PTB2_EMIOS_0_CH8_X_O            NXP_S32_PINMUX(0, 0, 34, 2, 0, 0)
#define PTB2_EMIOS_0_CH8_X_I            NXP_S32_PINMUX(0, 0, 34, 0, 56, 1)
#define PTB3_EMIOS_0_CH9_H_O            NXP_S32_PINMUX(0, 0, 35, 2, 0, 0)
#define PTB3_EMIOS_0_CH9_H_I            NXP_S32_PINMUX(0, 0, 35, 0, 57, 2)
#define PTB4_EMIOS_0_CH4_G_O            NXP_S32_PINMUX(0, 0, 36, 2, 0, 0)
#define PTB4_EMIOS_0_CH4_G_I            NXP_S32_PINMUX(0, 0, 36, 0, 52, 1)
#define PTB5_EMIOS_0_CH5_G_O            NXP_S32_PINMUX(0, 0, 37, 2, 0, 0)
#define PTB5_EMIOS_0_CH5_G_I            NXP_S32_PINMUX(0, 0, 37, 0, 53, 1)
#define PTB12_EMIOS_0_CH0_X_O           NXP_S32_PINMUX(0, 0, 44, 2, 0, 0)
#define PTB12_EMIOS_0_CH0_X_I           NXP_S32_PINMUX(0, 0, 44, 0, 48, 1)
#define PTB13_EMIOS_0_CH1_G_O           NXP_S32_PINMUX(0, 0, 45, 2, 0, 0)
#define PTB13_EMIOS_0_CH1_G_I           NXP_S32_PINMUX(0, 0, 45, 0, 49, 2)
#define PTB14_EMIOS_0_CH2_G_O           NXP_S32_PINMUX(0, 0, 46, 2, 0, 0)
#define PTB14_EMIOS_0_CH2_G_I           NXP_S32_PINMUX(0, 0, 46, 0, 50, 3)
#define PTB15_EMIOS_0_CH3_G_O           NXP_S32_PINMUX(0, 0, 47, 2, 0, 0)
#define PTB15_EMIOS_0_CH3_G_I           NXP_S32_PINMUX(0, 0, 47, 0, 51, 1)
#define PTB16_EMIOS_0_CH4_G_O           NXP_S32_PINMUX(0, 0, 48, 2, 0, 0)
#define PTB16_EMIOS_0_CH4_G_I           NXP_S32_PINMUX(0, 0, 48, 0, 52, 2)
#define PTB17_EMIOS_0_CH5_G_O           NXP_S32_PINMUX(0, 0, 49, 2, 0, 0)
#define PTB17_EMIOS_0_CH5_G_I           NXP_S32_PINMUX(0, 0, 49, 0, 53, 2)
#define PTC0_EMIOS_0_CH0_X_O            NXP_S32_PINMUX(0, 0, 64, 2, 0, 0)
#define PTC0_EMIOS_0_CH14_H_O           NXP_S32_PINMUX(0, 0, 64, 6, 0, 0)
#define PTC0_EMIOS_0_CH0_X_I            NXP_S32_PINMUX(0, 0, 64, 0, 48, 3)
#define PTC0_EMIOS_0_CH14_H_I           NXP_S32_PINMUX(0, 0, 64, 0, 62, 2)
#define PTC1_EMIOS_0_CH1_G_O            NXP_S32_PINMUX(0, 0, 65, 2, 0, 0)
#define PTC1_EMIOS_0_CH15_H_O           NXP_S32_PINMUX(0, 0, 65, 6, 0, 0)
#define PTC1_EMIOS_0_CH1_G_I            NXP_S32_PINMUX(0, 0, 65, 0, 49, 1)
#define PTC1_EMIOS_0_CH15_H_I           NXP_S32_PINMUX(0, 0, 65, 0, 63, 1)
#define PTC2_EMIOS_0_CH2_G_O            NXP_S32_PINMUX(0, 0, 66, 2, 0, 0)
#define PTC2_EMIOS_0_CH2_G_I            NXP_S32_PINMUX(0, 0, 66, 0, 50, 2)
#define PTC3_EMIOS_0_CH3_G_O            NXP_S32_PINMUX(0, 0, 67, 2, 0, 0)
#define PTC3_EMIOS_0_CH3_G_I            NXP_S32_PINMUX(0, 0, 67, 0, 51, 3)
#define PTC4_EMIOS_0_CH8_X_O            NXP_S32_PINMUX(0, 0, 68, 2, 0, 0)
#define PTC4_EMIOS_0_CH8_X_I            NXP_S32_PINMUX(0, 0, 68, 0, 56, 2)
#define PTC5_EMIOS_0_CH16_X_O           NXP_S32_PINMUX(0, 0, 69, 2, 0, 0)
#define PTC5_EMIOS_0_CH16_X_I           NXP_S32_PINMUX(0, 0, 69, 0, 64, 2)
#define PTC10_EMIOS_0_CH6_G_O           NXP_S32_PINMUX(0, 0, 74, 1, 0, 0)
#define PTC10_EMIOS_0_CH6_G_I           NXP_S32_PINMUX(0, 0, 74, 0, 54, 4)
#define PTC12_EMIOS_0_CH22_X_O          NXP_S32_PINMUX(0, 0, 76, 3, 0, 0)
#define PTC12_EMIOS_0_CH22_X_I          NXP_S32_PINMUX(0, 0, 76, 0, 70, 2)
#define PTC13_EMIOS_0_CH23_X_O          NXP_S32_PINMUX(0, 0, 77, 3, 0, 0)
#define PTC13_EMIOS_0_CH23_X_I          NXP_S32_PINMUX(0, 0, 77, 0, 71, 1)
#define PTC14_EMIOS_0_CH10_H_O          NXP_S32_PINMUX(0, 0, 78, 2, 0, 0)
#define PTC14_EMIOS_0_CH10_H_I          NXP_S32_PINMUX(0, 0, 78, 0, 58, 1)
#define PTC15_EMIOS_0_CH11_H_O          NXP_S32_PINMUX(0, 0, 79, 2, 0, 0)
#define PTC15_EMIOS_0_CH11_H_I          NXP_S32_PINMUX(0, 0, 79, 0, 59, 1)
#define PTD0_EMIOS_0_CH2_G_O            NXP_S32_PINMUX(0, 0, 96, 2, 0, 0)
#define PTD0_EMIOS_0_CH16_X_O           NXP_S32_PINMUX(0, 0, 96, 4, 0, 0)
#define PTD0_EMIOS_0_CH2_G_I            NXP_S32_PINMUX(0, 0, 96, 0, 50, 1)
#define PTD0_EMIOS_0_CH16_X_I           NXP_S32_PINMUX(0, 0, 96, 0, 64, 1)
#define PTD1_EMIOS_0_CH3_G_O            NXP_S32_PINMUX(0, 0, 97, 2, 0, 0)
#define PTD1_EMIOS_0_CH17_Y_O           NXP_S32_PINMUX(0, 0, 97, 4, 0, 0)
#define PTD1_EMIOS_0_CH3_G_I            NXP_S32_PINMUX(0, 0, 97, 0, 51, 2)
#define PTD1_EMIOS_0_CH17_Y_I           NXP_S32_PINMUX(0, 0, 97, 0, 65, 1)
#define PTD5_EMIOS_0_CH19_Y_O           NXP_S32_PINMUX(0, 0, 101, 2, 0, 0)
#define PTD5_EMIOS_0_CH2_G_O            NXP_S32_PINMUX(0, 0, 101, 3, 0, 0)
#define PTD5_EMIOS_0_CH2_G_I            NXP_S32_PINMUX(0, 0, 101, 0, 50, 4)
#define PTD5_EMIOS_0_CH19_Y_I           NXP_S32_PINMUX(0, 0, 101, 0, 67, 2)
#define PTD8_EMIOS_0_CH12_H_O           NXP_S32_PINMUX(0, 0, 104, 6, 0, 0)
#define PTD8_EMIOS_0_CH12_H_I           NXP_S32_PINMUX(0, 0, 104, 0, 60, 1)
#define PTD9_EMIOS_0_CH13_H_O           NXP_S32_PINMUX(0, 0, 105, 6, 0, 0)
#define PTD9_EMIOS_0_CH13_H_I           NXP_S32_PINMUX(0, 0, 105, 0, 61, 2)
#define PTD10_EMIOS_0_CH16_X_O          NXP_S32_PINMUX(0, 0, 106, 2, 0, 0)
#define PTD10_EMIOS_0_CH16_X_I          NXP_S32_PINMUX(0, 0, 106, 0, 64, 3)
#define PTD11_EMIOS_0_CH17_Y_O          NXP_S32_PINMUX(0, 0, 107, 2, 0, 0)
#define PTD11_EMIOS_0_CH17_Y_I          NXP_S32_PINMUX(0, 0, 107, 0, 65, 3)
#define PTD12_EMIOS_0_CH18_Y_O          NXP_S32_PINMUX(0, 0, 108, 2, 0, 0)
#define PTD12_EMIOS_0_CH18_Y_I          NXP_S32_PINMUX(0, 0, 108, 0, 66, 1)
#define PTD13_EMIOS_0_CH20_Y_O          NXP_S32_PINMUX(0, 0, 109, 2, 0, 0)
#define PTD13_EMIOS_0_CH20_Y_I          NXP_S32_PINMUX(0, 0, 109, 0, 68, 1)
#define PTD14_EMIOS_0_CH21_Y_O          NXP_S32_PINMUX(0, 0, 110, 2, 0, 0)
#define PTD14_EMIOS_0_CH21_Y_I          NXP_S32_PINMUX(0, 0, 110, 0, 69, 1)
#define PTD15_EMIOS_0_CH0_X_O           NXP_S32_PINMUX(0, 0, 111, 2, 0, 0)
#define PTD15_EMIOS_0_CH0_X_I           NXP_S32_PINMUX(0, 0, 111, 0, 48, 2)
#define PTD16_EMIOS_0_CH1_G_O           NXP_S32_PINMUX(0, 0, 112, 2, 0, 0)
#define PTD16_EMIOS_0_CH1_G_I           NXP_S32_PINMUX(0, 0, 112, 0, 49, 3)
#define PTD17_EMIOS_0_CH18_Y_O          NXP_S32_PINMUX(0, 0, 113, 2, 0, 0)
#define PTD17_EMIOS_0_CH18_Y_I          NXP_S32_PINMUX(0, 0, 113, 0, 66, 3)
#define PTE2_EMIOS_0_CH3_G_O            NXP_S32_PINMUX(0, 0, 130, 3, 0, 0)
#define PTE2_EMIOS_0_CH3_G_I            NXP_S32_PINMUX(0, 0, 130, 0, 51, 5)
#define PTE3_EMIOS_0_CH19_Y_O           NXP_S32_PINMUX(0, 0, 131, 3, 0, 0)
#define PTE3_EMIOS_0_CH19_Y_I           NXP_S32_PINMUX(0, 0, 131, 0, 67, 4)
#define PTE4_EMIOS_0_CH18_Y_O           NXP_S32_PINMUX(0, 0, 132, 4, 0, 0)
#define PTE4_EMIOS_0_CH18_Y_I           NXP_S32_PINMUX(0, 0, 132, 0, 66, 2)
#define PTE5_EMIOS_0_CH19_Y_O           NXP_S32_PINMUX(0, 0, 133, 4, 0, 0)
#define PTE5_EMIOS_0_CH19_Y_I           NXP_S32_PINMUX(0, 0, 133, 0, 67, 1)
#define PTE7_EMIOS_0_CH7_G_O            NXP_S32_PINMUX(0, 0, 135, 2, 0, 0)
#define PTE7_EMIOS_0_CH7_G_I            NXP_S32_PINMUX(0, 0, 135, 0, 55, 2)
#define PTE8_EMIOS_0_CH6_G_O            NXP_S32_PINMUX(0, 0, 136, 2, 0, 0)
#define PTE8_EMIOS_0_CH6_G_I            NXP_S32_PINMUX(0, 0, 136, 0, 54, 1)
#define PTE9_EMIOS_0_CH7_G_O            NXP_S32_PINMUX(0, 0, 137, 2, 0, 0)
#define PTE9_EMIOS_0_CH7_G_I            NXP_S32_PINMUX(0, 0, 137, 0, 55, 1)
#define PTE10_EMIOS_0_CH20_Y_O          NXP_S32_PINMUX(0, 0, 138, 4, 0, 0)
#define PTE10_EMIOS_0_CH20_Y_I          NXP_S32_PINMUX(0, 0, 138, 0, 68, 2)
#define PTE11_EMIOS_0_CH1_G_O           NXP_S32_PINMUX(0, 0, 139, 3, 0, 0)
#define PTE11_EMIOS_0_CH21_Y_O          NXP_S32_PINMUX(0, 0, 139, 4, 0, 0)
#define PTE11_EMIOS_0_CH1_G_I           NXP_S32_PINMUX(0, 0, 139, 0, 49, 4)
#define PTE11_EMIOS_0_CH21_Y_I          NXP_S32_PINMUX(0, 0, 139, 0, 69, 2)
#define PTE14_EMIOS_0_CH19_Y_O          NXP_S32_PINMUX(0, 0, 142, 1, 0, 0)
#define PTE14_EMIOS_0_CH19_Y_I          NXP_S32_PINMUX(0, 0, 142, 0, 67, 3)
#define PTE15_EMIOS_0_CH22_X_O          NXP_S32_PINMUX(0, 0, 143, 4, 0, 0)
#define PTE15_EMIOS_0_CH22_X_I          NXP_S32_PINMUX(0, 0, 143, 0, 70, 1)
#define PTE16_EMIOS_0_CH23_X_O          NXP_S32_PINMUX(0, 0, 144, 4, 0, 0)
#define PTE16_EMIOS_0_CH23_X_I          NXP_S32_PINMUX(0, 0, 144, 0, 71, 2)
#define PTE19_EMIOS_0_CH22_X_O          NXP_S32_PINMUX(0, 0, 147, 2, 0, 0)
#define PTE19_EMIOS_0_CH22_X_I          NXP_S32_PINMUX(0, 0, 147, 0, 70, 3)

