zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXE317MPA-pinctrl.h
/* CAN1 */
#define PTA11_CAN1_TX                   NXP_S32_PINMUX(0, 0, 11, 1, 0, 0)
#define PTA12_CAN1_RX                   NXP_S32_PINMUX(0, 0, 12, 0, 1, 2)
#define PTB22_CAN1_TX                   NXP_S32_PINMUX(0, 0, 54, 1, 0, 0)
#define PTB23_CAN1_RX                   NXP_S32_PINMUX(0, 0, 55, 0, 1, 4)
#define PTC8_CAN1_TX                    NXP_S32_PINMUX(0, 0, 72, 3, 0, 0)
#define PTC9_CAN1_RX                    NXP_S32_PINMUX(0, 0, 73, 0, 1, 1)

/* CMP1 */
#define PTA12_CMP1_OUT                  NXP_S32_PINMUX(0, 0, 12, 7, 0, 0)
#define PTE15_CMP1_RR_ACTIVE            NXP_S32_PINMUX(0, 0, 143, 5, 0, 0)

/* LPUART6 */
#define PTA15_LPUART6_RX                NXP_S32_PINMUX(0, 0, 15, 0, 193, 2)
#define PTA16_LPUART6_TX_O              NXP_S32_PINMUX(0, 0, 16, 5, 0, 0)
#define PTA16_LPUART6_TX_I              NXP_S32_PINMUX(0, 0, 16, 0, 369, 1)
#define PTB29_LPUART6_TX_O              NXP_S32_PINMUX(0, 0, 61, 1, 0, 0)
#define PTB29_LPUART6_TX_I              NXP_S32_PINMUX(0, 0, 61, 0, 369, 3)
#define PTC18_LPUART6_RX                NXP_S32_PINMUX(0, 0, 82, 0, 193, 4)
#define PTD8_LPUART6_RX                 NXP_S32_PINMUX(0, 0, 104, 0, 193, 1)
#define PTD9_LPUART6_TX_O               NXP_S32_PINMUX(0, 0, 105, 4, 0, 0)
#define PTD9_LPUART6_TX_I               NXP_S32_PINMUX(0, 0, 105, 0, 369, 2)

/* LPUART4 */
#define PTA17_LPUART4_TX_O              NXP_S32_PINMUX(0, 0, 17, 4, 0, 0)
#define PTA17_LPUART4_TX_I              NXP_S32_PINMUX(0, 0, 17, 0, 367, 1)
#define PTB16_LPUART4_TX_O              NXP_S32_PINMUX(0, 0, 48, 4, 0, 0)
#define PTB16_LPUART4_TX_I              NXP_S32_PINMUX(0, 0, 48, 0, 367, 2)
#define PTB17_LPUART4_RX                NXP_S32_PINMUX(0, 0, 49, 0, 191, 3)
#define PTE7_LPUART4_RX                 NXP_S32_PINMUX(0, 0, 135, 0, 191, 4)
#define PTE10_LPUART4_RX                NXP_S32_PINMUX(0, 0, 138, 0, 191, 2)
#define PTE11_LPUART4_TX_O              NXP_S32_PINMUX(0, 0, 139, 1, 0, 0)
#define PTE11_LPUART4_TX_I              NXP_S32_PINMUX(0, 0, 139, 0, 367, 3)

/* LPI2C0 */
#define PTB0_LPI2C0_SDAS_O              NXP_S32_PINMUX(0, 0, 32, 1, 0, 0)
#define PTB0_LPI2C0_SDAS_I              NXP_S32_PINMUX(0, 0, 32, 0, 215, 1)
#define PTB1_LPI2C0_SCLS_O              NXP_S32_PINMUX(0, 0, 33, 1, 0, 0)
#define PTB1_LPI2C0_SCLS_I              NXP_S32_PINMUX(0, 0, 33, 0, 213, 1)
#define PTB11_LPI2C0_HREQ               NXP_S32_PINMUX(0, 0, 43, 0, 211, 1)
#define PTC7_LPI2C0_HREQ                NXP_S32_PINMUX(0, 0, 71, 0, 211, 2)
#define PTC8_LPI2C0_SCL_O               NXP_S32_PINMUX(0, 0, 72, 1, 0, 0)
#define PTC8_LPI2C0_SCL_I               NXP_S32_PINMUX(0, 0, 72, 0, 212, 1)
#define PTC9_LPI2C0_SDA_O               NXP_S32_PINMUX(0, 0, 73, 1, 0, 0)
#define PTC9_LPI2C0_SDA_I               NXP_S32_PINMUX(0, 0, 73, 0, 214, 1)
#define PTD13_LPI2C0_SDA_O              NXP_S32_PINMUX(0, 0, 109, 4, 0, 0)
#define PTD13_LPI2C0_SDA_I              NXP_S32_PINMUX(0, 0, 109, 0, 214, 2)
#define PTD14_LPI2C0_SCL_O              NXP_S32_PINMUX(0, 0, 110, 4, 0, 0)
#define PTD14_LPI2C0_SCL_I              NXP_S32_PINMUX(0, 0, 110, 0, 212, 2)

/* LCU1 */
#define PTB0_LCU1_OUT5                  NXP_S32_PINMUX(0, 0, 32, 5, 0, 0)
#define PTB1_LCU1_OUT4                  NXP_S32_PINMUX(0, 0, 33, 7, 0, 0)
#define PTB2_LCU1_OUT3                  NXP_S32_PINMUX(0, 0, 34, 5, 0, 0)
#define PTB3_LCU1_OUT2                  NXP_S32_PINMUX(0, 0, 35, 6, 0, 0)
#define PTB28_LCU1_OUT11                NXP_S32_PINMUX(0, 0, 60, 6, 0, 0)
#define PTB29_LCU1_OUT10                NXP_S32_PINMUX(0, 0, 61, 6, 0, 0)
#define PTC8_LCU1_OUT7                  NXP_S32_PINMUX(0, 0, 72, 5, 0, 0)
#define PTC9_LCU1_OUT6                  NXP_S32_PINMUX(0, 0, 73, 5, 0, 0)
#define PTC10_LCU1_OUT11                NXP_S32_PINMUX(0, 0, 74, 6, 0, 0)
#define PTC11_LCU1_OUT10                NXP_S32_PINMUX(0, 0, 75, 7, 0, 0)
#define PTC12_LCU1_OUT9                 NXP_S32_PINMUX(0, 0, 76, 6, 0, 0)
#define PTC13_LCU1_OUT8                 NXP_S32_PINMUX(0, 0, 77, 6, 0, 0)
#define PTC14_LCU1_OUT1                 NXP_S32_PINMUX(0, 0, 78, 6, 0, 0)
#define PTC15_LCU1_OUT0                 NXP_S32_PINMUX(0, 0, 79, 6, 0, 0)
#define PTC18_LCU1_OUT7                 NXP_S32_PINMUX(0, 0, 82, 6, 0, 0)
#define PTC19_LCU1_OUT6                 NXP_S32_PINMUX(0, 0, 83, 6, 0, 0)
#define PTC20_LCU1_OUT5                 NXP_S32_PINMUX(0, 0, 84, 6, 0, 0)
#define PTC21_LCU1_OUT4                 NXP_S32_PINMUX(0, 0, 85, 6, 0, 0)
#define PTC23_LCU1_OUT0                 NXP_S32_PINMUX(0, 0, 87, 6, 0, 0)
#define PTC24_LCU1_OUT1                 NXP_S32_PINMUX(0, 0, 88, 6, 0, 0)
#define PTC25_LCU1_OUT2                 NXP_S32_PINMUX(0, 0, 89, 6, 0, 0)
#define PTC26_LCU1_OUT9                 NXP_S32_PINMUX(0, 0, 90, 6, 0, 0)
#define PTC27_LCU1_OUT3                 NXP_S32_PINMUX(0, 0, 91, 6, 0, 0)
#define PTC28_LCU1_OUT8                 NXP_S32_PINMUX(0, 0, 92, 6, 0, 0)

/* HSE */
#define PTB0_HSE_TAMPER_LOOP_OUT0       NXP_S32_PINMUX(0, 0, 32, 7, 0, 0)
#define PTB1_HSE_TAMPER_EXTIN0          NXP_S32_PINMUX(0, 0, 33, 0, 343, 1)
#define PTB30_HSE_TAMPER_LOOP_OUT0      NXP_S32_PINMUX(0, 0, 62, 5, 0, 0)
#define PTD23_HSE_TAMPER_LOOP_OUT0      NXP_S32_PINMUX(0, 0, 119, 5, 0, 0)
#define PTD24_HSE_TAMPER_EXTIN0         NXP_S32_PINMUX(0, 0, 120, 0, 343, 2)

/* ADC1 */
#define PTB2_ADC1_MA0                   NXP_S32_PINMUX(0, 0, 34, 1, 0, 0)
#define PTB23_ADC1_MA0                  NXP_S32_PINMUX(0, 0, 55, 1, 0, 0)
#define PTB24_ADC1_MA1                  NXP_S32_PINMUX(0, 0, 56, 1, 0, 0)
#define PTB28_ADC1_MA2                  NXP_S32_PINMUX(0, 0, 60, 1, 0, 0)
#define PTC12_ADC1_MA2                  NXP_S32_PINMUX(0, 0, 76, 1, 0, 0)
#define PTC13_ADC1_MA1                  NXP_S32_PINMUX(0, 0, 77, 4, 0, 0)
#define PTC20_ADC1_MA2                  NXP_S32_PINMUX(0, 0, 84, 5, 0, 0)
#define PTC21_ADC1_MA1                  NXP_S32_PINMUX(0, 0, 85, 5, 0, 0)
#define PTC27_ADC1_MA0                  NXP_S32_PINMUX(0, 0, 91, 5, 0, 0)

/* CAN4 */
#define PTB2_CAN4_RX                    NXP_S32_PINMUX(0, 0, 34, 0, 4, 2)
#define PTB3_CAN4_TX                    NXP_S32_PINMUX(0, 0, 35, 5, 0, 0)
#define PTC30_CAN4_TX                   NXP_S32_PINMUX(0, 0, 94, 1, 0, 0)
#define PTC31_CAN4_RX                   NXP_S32_PINMUX(0, 0, 95, 0, 4, 3)
#define PTE3_CAN4_TX                    NXP_S32_PINMUX(0, 0, 131, 1, 0, 0)
#define PTE14_CAN4_RX                   NXP_S32_PINMUX(0, 0, 142, 0, 4, 1)

/* ADC0 */
#define PTB3_ADC0_MA0                   NXP_S32_PINMUX(0, 0, 35, 4, 0, 0)
#define PTC6_ADC0_MA2                   NXP_S32_PINMUX(0, 0, 70, 7, 0, 0)
#define PTC14_ADC0_MA1                  NXP_S32_PINMUX(0, 0, 78, 4, 0, 0)
#define PTC15_ADC0_MA2                  NXP_S32_PINMUX(0, 0, 79, 4, 0, 0)
#define PTE2_ADC0_MA0                   NXP_S32_PINMUX(0, 0, 130, 7, 0, 0)
#define PTE6_ADC0_MA1                   NXP_S32_PINMUX(0, 0, 134, 7, 0, 0)

/* LPUART7 */
#define PTB14_LPUART7_RX                NXP_S32_PINMUX(0, 0, 46, 0, 194, 1)
#define PTB15_LPUART7_TX_O              NXP_S32_PINMUX(0, 0, 47, 6, 0, 0)
#define PTB15_LPUART7_TX_I              NXP_S32_PINMUX(0, 0, 47, 0, 370, 1)
#define PTC19_LPUART7_TX_O              NXP_S32_PINMUX(0, 0, 83, 1, 0, 0)
#define PTC19_LPUART7_TX_I              NXP_S32_PINMUX(0, 0, 83, 0, 370, 2)
#define PTC20_LPUART7_RX                NXP_S32_PINMUX(0, 0, 84, 0, 194, 4)
#define PTE0_LPUART7_RX                 NXP_S32_PINMUX(0, 0, 128, 0, 194, 2)
#define PTE1_LPUART7_TX_O               NXP_S32_PINMUX(0, 0, 129, 6, 0, 0)
#define PTE1_LPUART7_TX_I               NXP_S32_PINMUX(0, 0, 129, 0, 370, 3)

/* LPUART5 */
#define PTB27_LPUART5_TX_O              NXP_S32_PINMUX(0, 0, 59, 1, 0, 0)
#define PTB27_LPUART5_TX_I              NXP_S32_PINMUX(0, 0, 59, 0, 368, 3)
#define PTB28_LPUART5_RX                NXP_S32_PINMUX(0, 0, 60, 0, 192, 4)
#define PTD0_LPUART5_RX                 NXP_S32_PINMUX(0, 0, 96, 0, 192, 2)
#define PTD1_LPUART5_TX_O               NXP_S32_PINMUX(0, 0, 97, 1, 0, 0)
#define PTD1_LPUART5_TX_I               NXP_S32_PINMUX(0, 0, 97, 0, 368, 1)
#define PTE3_LPUART5_RX                 NXP_S32_PINMUX(0, 0, 131, 0, 192, 1)
#define PTE14_LPUART5_TX_O              NXP_S32_PINMUX(0, 0, 142, 4, 0, 0)
#define PTE14_LPUART5_TX_I              NXP_S32_PINMUX(0, 0, 142, 0, 368, 2)

/* CAN3 */
#define PTC0_CAN3_TX                    NXP_S32_PINMUX(0, 0, 64, 1, 0, 0)
#define PTC1_CAN3_RX                    NXP_S32_PINMUX(0, 0, 65, 0, 3, 2)
#define PTC28_CAN3_TX                   NXP_S32_PINMUX(0, 0, 92, 1, 0, 0)
#define PTC29_CAN3_RX                   NXP_S32_PINMUX(0, 0, 93, 0, 3, 3)
#define PTD15_CAN3_RX                   NXP_S32_PINMUX(0, 0, 111, 0, 3, 1)
#define PTE9_CAN3_TX                    NXP_S32_PINMUX(0, 0, 137, 4, 0, 0)

