zephyrproject-rtos/hal_nxp/dts/nxp/mcx/MCXE317MPA-pinctrl.h
/* LPI2C1 */
#define PTC5_LPI2C1_HREQ                NXP_S32_PINMUX(0, 0, 69, 0, 216, 2)
#define PTC6_LPI2C1_SDA_O               NXP_S32_PINMUX(0, 0, 70, 1, 0, 0)
#define PTC6_LPI2C1_SDA_I               NXP_S32_PINMUX(0, 0, 70, 0, 219, 2)
#define PTC7_LPI2C1_SCL_O               NXP_S32_PINMUX(0, 0, 71, 3, 0, 0)
#define PTC7_LPI2C1_SCL_I               NXP_S32_PINMUX(0, 0, 71, 0, 217, 1)
#define PTC15_LPI2C1_SCL_O              NXP_S32_PINMUX(0, 0, 79, 7, 0, 0)
#define PTC15_LPI2C1_SCL_I              NXP_S32_PINMUX(0, 0, 79, 0, 217, 6)
#define PTC16_LPI2C1_SDAS_O             NXP_S32_PINMUX(0, 0, 80, 4, 0, 0)
#define PTC16_LPI2C1_SDA_O              NXP_S32_PINMUX(0, 0, 80, 7, 0, 0)
#define PTC16_LPI2C1_SDA_I              NXP_S32_PINMUX(0, 0, 80, 0, 219, 5)
#define PTC16_LPI2C1_SDAS_I             NXP_S32_PINMUX(0, 0, 80, 0, 220, 1)
#define PTC17_LPI2C1_SCLS_O             NXP_S32_PINMUX(0, 0, 81, 4, 0, 0)
#define PTC17_LPI2C1_SCLS_I             NXP_S32_PINMUX(0, 0, 81, 0, 218, 2)
#define PTC28_LPI2C1_SCL_O              NXP_S32_PINMUX(0, 0, 92, 5, 0, 0)
#define PTC28_LPI2C1_SCL_I              NXP_S32_PINMUX(0, 0, 92, 0, 217, 4)
#define PTC29_LPI2C1_SDA_O              NXP_S32_PINMUX(0, 0, 93, 5, 0, 0)
#define PTC29_LPI2C1_SDA_I              NXP_S32_PINMUX(0, 0, 93, 0, 219, 3)
#define PTD8_LPI2C1_SDA_O               NXP_S32_PINMUX(0, 0, 104, 2, 0, 0)
#define PTD8_LPI2C1_SDA_I               NXP_S32_PINMUX(0, 0, 104, 0, 219, 1)
#define PTD9_LPI2C1_SCL_O               NXP_S32_PINMUX(0, 0, 105, 2, 0, 0)
#define PTD9_LPI2C1_SCL_I               NXP_S32_PINMUX(0, 0, 105, 0, 217, 2)
#define PTD12_LPI2C1_HREQ               NXP_S32_PINMUX(0, 0, 108, 0, 216, 1)

/* CAN2 */
#define PTC6_CAN2_RX                    NXP_S32_PINMUX(0, 0, 70, 0, 2, 6)
#define PTC7_CAN2_TX                    NXP_S32_PINMUX(0, 0, 71, 7, 0, 0)
#define PTC14_CAN2_RX                   NXP_S32_PINMUX(0, 0, 78, 0, 2, 2)
#define PTC15_CAN2_TX                   NXP_S32_PINMUX(0, 0, 79, 1, 0, 0)
#define PTC16_CAN2_RX                   NXP_S32_PINMUX(0, 0, 80, 0, 2, 1)
#define PTC17_CAN2_TX                   NXP_S32_PINMUX(0, 0, 81, 3, 0, 0)
#define PTD18_CAN2_TX                   NXP_S32_PINMUX(0, 0, 114, 1, 0, 0)
#define PTE24_CAN2_TX                   NXP_S32_PINMUX(0, 0, 152, 3, 0, 0)
#define PTE25_CAN2_RX                   NXP_S32_PINMUX(0, 0, 153, 0, 2, 3)

/* CAN5 */
#define PTC10_CAN5_TX                   NXP_S32_PINMUX(0, 0, 74, 3, 0, 0)
#define PTC11_CAN5_RX                   NXP_S32_PINMUX(0, 0, 75, 0, 5, 2)
#define PTC26_CAN5_RX                   NXP_S32_PINMUX(0, 0, 90, 0, 5, 5)
#define PTC27_CAN5_TX                   NXP_S32_PINMUX(0, 0, 91, 1, 0, 0)
#define PTD17_CAN5_RX                   NXP_S32_PINMUX(0, 0, 113, 0, 5, 1)
#define PTE12_CAN5_TX                   NXP_S32_PINMUX(0, 0, 140, 2, 0, 0)

#endif /* HAL_NXP_DTS_NXP_MCXE317MPA_PINCTRL_H_ */
